src/main/java/com/amdocs/halo/automation/xmls/CNOD_RCPC.xml

<soapenv:Envelope xmlns:ocx="http://oCXOrderingServices.interfaces.oms.services.cih.amdocs.com" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <ocx:retrieveCatalogProductForConfiguration>
         <OrderingContext>
            <locale>
               <country>US</country>
               <language>en</language>
               <variant/>
            </locale>
            <salesChannel>
               <valueAsString>SA</valueAsString>
            </salesChannel>
         </OrderingContext>
         <RetrieveCatalogProductForConfigurationInput>
            <catalogProducts>
               <availableOffer>
                  <!--Optional:-->
                  <catalogOffer>
                     <!--Optional:-->
                     <catalogOfferID>
                        <!--Optional:-->
                        <catalogOfferID>{$catalogOfferID$}</catalogOfferID>
                     </catalogOfferID>
                  </catalogOffer>
                  <!--Zero or more repetitions:-->
               </availableOffer>
            </catalogProducts>
            <!--Optional:-->
            <productCatalogConfigurationOptions>
               <!--Optional:-->
               <activity>
                  <!--Optional:-->
                  <valueAsString>ShoppingCart</valueAsString>
               </activity>
               <!--Optional:-->
               <confirmationChecksApproved>true</confirmationChecksApproved>
               <ruleValidationStage>
                  <!--Optional:-->
                  <valueAsString>Init</valueAsString>
               </ruleValidationStage>
            </productCatalogConfigurationOptions>
            <underlyingProductX9>
               <!--Zero or more repetitions:-->
               <dynamicAttributesX9>
                  <!--Optional:-->
                  <nameX9>ABC</nameX9>
                  <!--Optional:-->
                  <valueX9>123</valueX9>
               </dynamicAttributesX9>
               <dynamicAttributesX9>
                  <!--Optional:-->
                  <nameX9>CircuitID</nameX9>
                  <!--Optional:-->
                  <valueX9>100</valueX9>
               </dynamicAttributesX9>
               <dynamicAttributesX9>
                  <!--Optional:-->
                  <nameX9>CIRSpeed</nameX9>
                  <!--Optional:-->
                  <valueX9>100</valueX9>
               </dynamicAttributesX9>
               <dynamicAttributesX9>
                  <!--Optional:-->
                  <nameX9>DesignConfiguration</nameX9>
                  <!--Optional:-->
                  <valueX9>Port Based</valueX9>
               </dynamicAttributesX9>
               <dynamicAttributesX9>
                  <!--Optional:-->
                  <nameX9>ClassofService</nameX9>
                  <!--Optional:-->
                  <valueX9>Interactive</valueX9>
               </dynamicAttributesX9>
            </underlyingProductX9>
         </RetrieveCatalogProductForConfigurationInput>
      </ocx:retrieveCatalogProductForConfiguration>
   </soapenv:Body>
</soapenv:Envelope>